{"0": "Approaching warm — Provide shade and ensure drinking water is cool and available.", "1": "Borderline survival — Environmental controls failing. Apply direct pig cooling.", "2": "Chilly — Monitor piglet behavior and provide supplemental heat as needed.", "3": "Cold — Pigs may huddle and grow slower. Add bedding or heating to maintain warmth.", "4": "Comfortable — Ensure consistent water supply and monitor for signs of heat buildup.", "5": "Comfortable — Monitor pigs for panting or excessive lying down.", "6": "Critical emergency — All pigs should be moved to cooler barns if possible.", "7": "Critical — Pigs are at risk of collapse. Immediate cooling actions required.", "8": "Dangerously hot — Move pigs to shaded or cooled areas. Avoid handling or transport.", "9": "Deadly — Keep pigs calm. Ensure 24/7 access to cool, clean water.", "10": "Extreme danger — Pigs must be sprayed with water. Increase airflow urgently.", "11": "Extreme heat — Limit feed during daytime. Use misting or evaporative cooling.", "12": "High fatality risk — Maintain emergency protocols and monitor water systems.", "13": "High — Provide additional shade and ensure cool water access.", "14": "Hot — Heat stress may begin. Increase ventilation and reduce crowding.", "15": "Ideal for young pigs — Keep this temperature with proper ventilation and bedding.", "16": "Lethal range — High mortality risk. Activate all emergency cooling systems.", "17": "Maximum heat stress — Expect high mortality without immediate interventions.", "18": "Near lethal — Move pigs only at night. Monitor all closely for heat stroke.", "19": "Normal — Keep environment clean and dry. Maintain airflow.", "20": "Severe heat stress — Expect reduced feed intake. Emergency cooling needed.", "21": "Slightly cold — Maintain dry bedding to reduce cold stress in young pigs.", "22": "Slightly hot — Consider using misting systems or fans to cool down.", "23": "Too cold — Risk of respiratory stress. Use heaters or plastic curtains to reduce drafts.", "24": "Too hot — Use cooling pads or wet floors. Watch for signs of distress.", "25": "Unsafe — Pigs may stop eating and collapse. Reduce activity and increase cooling.", "26": "Unsustainable — Environment not suitable. Call vet if pigs show lethargy or collapse.", "27": "Very cold — Young pigs may suffer from hypothermia. Provide heat lamps or insulated flooring.", "28": "Very dangerous — Avoid any movement. Use fans, sprinklers, and shaded pens.", "29": "Very hot — Risk of heat exhaustion. Spray pigs with cool water and provide fans.", "30": "Warm — Increase airflow to avoid heat stress buildup."}